app/controllers/lists_controller.rb

SELECT "lists".* FROM "lists" ORDER BY "lists"."duedate" ASC
---
  def index
    # 依到期日 (due_date) 近到遠，取得 todos
    @lists = List.order(duedate: :asc)

INSERT INTO "lists" ("event", "duedate", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["event", "aefaksdjf"], ["duedate", "2017-02-02"], ["description", "fasdf"], ["created_at", "2017-12-07 08:55:24.111461"], ["updated_at", "2017-12-07 08:55:24.111461"]]
---
  def create
    # 依傳入參數 new 一個 List 實例
    @list = List.new(list_params)
    # 如果驗證成功，則儲存，並回到列表頁，告知成功新增
    # 如果驗證失敗，則不儲存，並保留已填寫資訊，回到 new，繼續填寫
    if @list.save

UPDATE "lists" SET "description" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["description", "123"], ["updated_at", "2017-12-13 08:03:11.017372"], ["id", 8]]
---
  def update
    # @list = List.find(params[:id])
    # 此行的作用已被 before_action :set_list 取代
    if @list.update_attributes(list_params)

DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 4]]
---
  def destroy
    if @list.duedate >= Time.now.to_date
      @list.destroy

UPDATE "lists" SET "is_done" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["is_done", "t"], ["updated_at", "2017-12-21 11:22:09.630130"], ["id", 2]]
---
  def is_done
    @list.update(is_done: !(@list.is_done))